Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Note that if the DS map being saved contains an array, this will be converted into a DS list instead when saved.
zh_cn: 注意，如果保存的DS map包含一个数组，那么在保存时它将转换为DS列表。

source: Note that if the array index given is out of bounds then the game will crash with an error.
zh_cn: 注意，如果给定的数组索引超出边界，那么游戏将崩溃并报错。

source: Note that if the calling object have no sprite or no mask defined, the results will be incorrect.
zh_cn: 注意，如果调用对象没有定义sprite或mask，结果将是不正确的。

source: Note that if the curve or channel does not exist then you will get an error.
zh_cn: 注意，如果曲线或通道不存在，那么您将得到一个错误。

source: Note that if the entry being set is outside the bounds of the list (ie, you set list entry 20 but the current list only contains 10 entries) then the list will be filled to the given position and each entry will be set to 0.
zh_cn: 注意，如果设置的条目在列表的边界之外(即，您设置了列表条目20，但是当前列表只包含10个条目)，那么列表将被填充到给定的位置，并且每个条目将被设置为0。

source: Note that if the file can't be created (because of an illegal filename, for example) the function will return -1.
zh_cn: 注意，如果不能创建文件(例如，因为文件名非法)，函数将返回-1。

source: Note that if the index you search for has not been initialised previously, this function will cause an error as it is searching for non-existent asset indices.
zh_cn: 注意，如果您搜索的索引之前没有初始化，此函数将导致一个错误，因为它正在搜索不存在的资源索引。

source: Note that if the index you search for has not been initialised previously, this function will cause an error as it is searching for non-existent indices.
zh_cn: 注意，如果您搜索的索引之前没有初始化，此函数将导致错误，因为它正在搜索不存在的索引。

source: Note that if the layer the background element has been assigned to is not visible - or the element itself has been made invisible - you will not see any difference with this function until the layer or element has been made visible again.
zh_cn: 注意，如果背景元素分配到的图层不可见，或者元素本身不可见，则在图层或元素再次可见之前，您将看不到此函数的任何区别。

source: Note that if the layer the sprite element has been assigned to is not visible - or the element itself has been made invisible - you will not see any difference with this function until the layer or element has been made visible again.
zh_cn: 注意，如果精灵元素被分配到的图层不可见——或者元素本身不可见——在该图层或元素再次可见之前，你不会看到此函数的任何区别。

source: Note that if the number of vertices does not match those being copied you may get corrupted vertex data.
zh_cn: 注意，如果顶点数与正在复制的顶点数不匹配，则可能会获得损坏的顶点数据。

source: Note that if the sprite has sub-images then it will animate too (this can be controlled using the layer_sprite_index() and layer_sprite_speed() functions).
zh_cn: 注意，如果精灵有子图像，那么它也会有动画效果(这可以使用layer_sprite_index()和layer_sprite_speed()函数来控制)。

source: Note that if the sprites are different sizes, then the appended sprites are stretched to fit the image size for "ind1".
zh_cn: 注意，如果子画面大小不同，则附加的子画面会被拉伸以适合"ind1"的图像大小。

source: Note that if the texture page is used elsewhere in the room (by another instance sprite or a background, etc...) you may get a minor performance hit as the page is immediately reloaded, so care should be taken when using this function.
zh_cn: 注意，如果纹理页面在房间的其他地方使用(由另一个实例精灵或背景等...)当页面立即重新加载时，您可能会受到轻微的性能影响，因此在使用此函数时应该小心。

source: Note that if the value is outside of the tile map area, and no cell is available, it will return -1.
zh_cn: 注意，如果值在tile map区域之外，并且没有可用的单元格，它将返回-1。

source: Note that if the variable being checked is an uninitialised variable (that a particle emitterwould otherwise have its index assigned to) this will throw an error.
zh_cn: 注意，如果被检查的变量是一个未初始化的变量(否则粒子发射器会将其索引分配给该变量)，这将引发一个错误。

source: Note that if the variable being checked is an uninitialised variable (that a particle system would otherwise have its index assigned to) this will throw an error.
zh_cn: 注意，如果被检查的变量是一个未初始化的变量(粒子系统会将其索引赋值给该变量)，这将抛出一个错误。

source: Note that if the variable being checked is an uninitialised variable (that a particle type would otherwise have its index assigned to) this will throw an error.
zh_cn: 注意，如果被检查的变量是一个未初始化的变量(一个粒子类型将被赋予它的索引)，这将抛出一个错误。

source: Note that if there are more than one entries in the list with the same value, the position of any one of them may be returned, and that if the value does not exist, then -1 will be returned.
zh_cn: 注意，如果列表中有多个条目具有相同的值，则可以返回其中任何一个条目的位置，如果该值不存在，则将返回-1。

source: Note that if you check for the existence of a path through a variable that has yet to have been declared, this will throw an error.
zh_cn: 注意，如果您通过尚未声明的变量检查路径是否存在，这将引发错误。

source: Note that if you choose an object ID and there is more than one instance of that object in the room, there is no way for GameMaker to know which instance you wish to follow and so it could be any of them.
zh_cn: 注意，如果您选择了一个对象ID，并且房间中有该对象的多个实例，GameMaker将无法知道您希望跟随哪个实例，因此它可能是其中的任何一个。

source: Note that if you do not supply a full path to the ZIP directory then the current drive root will be used, and if you want to place it in a relative path to the game bundle working directory then you should use the working_directory variable as part of the path (relative paths using "." or ".." will not work as expected so should be avoided).
zh_cn: 注意，如果您没有提供ZIP目录的完整路径，那么将使用当前的驱动器根目录，如果您想要将它放在游戏捆绑包工作目录的相对路径中，那么您应该使用working_directory变量作为路径的一部分(相对路径使用"."还是".."不会按预期工作，因此应该避免)。

source: Note that if you give a position that is outside of the given list size (ie: position 11 in a 10 value list) then the function may return undefined or 0.
zh_cn: 注意，如果您给出的位置超出了给定的列表大小(即:10值列表中的位置11)，那么函数可能会返回undefined或0。

source: Note that if you give the name of a layer that does not exist in the current room, then you will get an error and the project will crash.
zh_cn: 注意，如果您给出的层名在当前房间中不存在，那么您将得到一个错误，项目将崩溃。

source: Note that if you have deactivated a layer that has instances of objects flagged as Persistent, then you will need to reactivate the layer again with the function instance_activate_layer() before changing room, otherwise any persistent instances on the layer will not be carried over and will be discarded.
zh_cn: 注意，如果你停用了一个带有标记为Persistent的对象实例的层，那么在更改房间之前，你将需要使用instance_activate_layer()函数重新激活该层，否则该层上的任何持久实例将不会被保留并被丢弃。

source: Note that if you have deactivated a layer that has persistent instances, you will need to reactivate the layer again with this function before changing room, otherwise any persistent instances will not be carried over and will be discarded.
zh_cn: 注意，如果你停用了一个有持久实例的层，你需要在换房间之前用此函数重新激活该层，否则任何持久实例都不会被保留下来，而是会被丢弃。

source: Note that if you have deactivated an instance or object that has been flagged as Persistent, then you will need to reactivate it again with the function instance_activate_object() before changing room, otherwise it will not be carried over and will be discarded instead.
zh_cn: 注意，如果您已经停用了一个标记为持久的实例或对象，那么您将需要在更换房间之前使用函数instance_activate_object()重新激活它，否则它将不会被保留，而是被丢弃。

source: Note that if you have deactivated an instance or object that has been flagged as Persistent, then you will need to reactivate it again with this function before changing room, otherwise it will not be carried over and will be discarded instead.
zh_cn: 注意，如果您已经停用了标记为Persistent的实例或对象，那么在更改房间之前，您需要使用此函数再次激活它，否则它将不会被保留下来，而是会被丢弃。

source: Note that if you pass the function a struct literal (ie: a struct that was created without using a constructor function) then it will simply return the string "struct".
zh_cn: 注意，如果你传递给函数一个结构字面值(即:一个没有使用构造函数创建的结构)，那么它将简单地返回字符串"struct"。

source: Note that if you supply a value that is not a weak reference, the function will return undefined.
zh_cn: 注意，如果提供的值不是弱引用，则函数将返回未定义。

source: Note that if you supply an array where any of the values are not a weak references, the function will return undefined.
zh_cn: 注意，如果您提供的数组中的任何值都不是弱引用，则函数将返回未定义。

source: Note that if you try and access a value in the list before it has been populated - i.e. the list is "empty" - then the return value may be 0 since internally the first few entries in the list are set when created to minimize performance issues when initially adding items to the list (although the ds_list_size() function will still return 0 on a newly created list).
zh_cn: 注意，如果在填充列表之前尝试访问列表中的值(即列表为"空")，则返回值可能为0，因为在内部，列表中的前几个条目是在创建时设置的，以最小化最初向列表添加项目时的性能问题(尽管在新创建的列表中，ds_list_size()函数仍将返回0)。

source: Note that if you try to use this format again after calling this function, you will get an error.
zh_cn: 注意，如果您在调用此函数后再次尝试使用此格式，将会出现错误。

source: Note that it will be considered triggered for the duration of the step, and for all instances that have any mouse events or that use this same function.
zh_cn: 注意，它将被认为在步骤持续期间被触发，并且对于所有具有任何鼠标事件或使用此相同函数的实例都被触发。

source: Note that it will restore the version of the game that was used to create the save, so any updates made after it will not be visible.
zh_cn: 注意，它将恢复用于创建保存的游戏版本，因此在它之后所做的任何更新都将不可见。

source: Note that mb_right will only be detected if a double tap touch is detected and held on the second tap (this behavior can be disabled using the function device_mouse_dbclick_enable()).
zh_cn: 注意，只有在检测到双击触摸并按住第二次点击时，才会检测到mb_right(可以使用函数device_mouse_dbclick_enable()禁用此行为)。

source: Note that mb_right will only have been detected if a double tap touch is detected and held on the second tap before release (this behavior can be disabled using the function device_mouse_dbclick_enable()).
zh_cn: 注意，只有在检测到双击触摸并在释放前第二次点击时按住时才会检测到mb_right(可以使用函数device_mouse_dbclick_enable()禁用此行为)。

source: Note that negative values are valid, and will "flip" the element around the (0,0) position, so an x scale of -1 would show the image reversed.
zh_cn: 注意，负值是有效的，并将围绕(0,0)位置"翻转"元素，因此x比例为-1将显示图像反转。

source: Note that no matter how far paired particles get from each another, the connection between them will not snap.
zh_cn: 注意，无论成对粒子彼此相距多远，它们之间的连接都不会突然断开。

source: Note that on all other platforms other than HTML5, the function will always return true..
zh_cn: 注意，在除HTML5之外的所有其他平台上，此函数将始终返回true..

source: Note that on both macOS and Ubuntu (Linux) the "HOME" environment variable will return the "~/" path which maps to "/Users/<username>" on macOS and "/home/<username>" on Ubuntu (Linux).
zh_cn: 注意，在macOS和Ubuntu (Linux)上，"HOME"环境变量将返回"~/"路径，该路径在macOS上映射到"/Users/<username >"，在Ubuntu (Linux)上映射到"/home/<username >"。

source: Note that on some platforms you can have a gain of greater than 1, although a value of 1 is considered "full volume" and anything greater may introduce audio clipping.
zh_cn: 注意，在某些平台上，您可以获得大于1的增益，尽管值1被视为"最大音量"，任何更大的值都可能引入音频削波。注意，在某些平台上，增益可能大于1，尽管1的值被认为是"完整音量"，任何大于1的值都可能导致音频削波。

source: Note that on the HTML5 target, this value is the height of the browser window, rather than the physical display size.
zh_cn: 注意，在HTML5目标上，这个值是浏览器窗口的高度，而不是物理显示大小。

source: Note that on the HTML5 target, this value is the width of the browser window, rather than the physical display size.
zh_cn: 注意，在HTML5目标上，这个值是浏览器窗口的宽度，而不是物理显示大小。

source: Note that reading will always start at the beginning of the buffer plus the offset value and not at the current seek position plus the offset value.
zh_cn: 注意，读取总是从缓冲区的开头加上偏移值开始，而不是从当前寻道位置加上偏移值开始。

source: Note that sequences created using the function sequence_create() will not have a name and this will simply be an empty string "".
zh_cn: 注意，使用sequence_create()函数创建的序列没有名称，而只是一个空字符串""。

source: Note that setting the speed and/or the direction, will also modify the values of the hspeed and vspeed variables, and that gravity, gravity_direction and friction can all modify the value of this variable when they are used in your games.
zh_cn: 注意，设置速度和/或方向也会修改hspeed和vspeed变量的值，并且重力、重力方向和摩擦力在游戏中使用时都会修改该变量的值。

source: Note that since there are no restrictions on file names for HTML5, this string will probably be the same as that returned by game_display_name.
zh_cn: 注意，由于HTML5对文件名没有限制，所以这个字符串可能与game_display_name返回的字符串相同。

source: Note that some languages also have a relevant Regional Code too, so to distinguish between different regions of the same country use the function os_get_region().
zh_cn: 注意，有些语言也有相关的地区代码，因此要区分同一国家的不同地区，请使用函数os_get_region()。

source: Note that the "width" argument is based on a scale of 1, so if the scale is different, this value should be changed proportionally.
zh_cn: 注意,"宽度"参数基于1的比例，因此如果比例不同，该值应该按比例更改。

source: Note that the DS map is not automatically cleared from memory and you should use the ds_map_destroy() function when you no longer need it.
zh_cn: 注意DS映射不会自动从内存中清除，当您不再需要它时，应该使用ds_map_destroy()函数。

source: Note that the buffer must have been created using the function ds_map_secure_save_buffer() for this to work correctly, and also note that if the DS map being loaded contained an array, this will be converted into a DS list instead on load.
zh_cn: 注意，缓冲区必须是使用ds_map_secure_save_buffer()函数创建的，这样才能正常工作，还要注意，如果正在加载的DS map包含一个数组，那么它将在加载时转换为DS列表。

source: Note that the description given here is for the default z-testing comparison mode, but that can be changed
zh_cn: 注意，这里给出的描述是针对默认的z-测试比较模式，但可以更改

source: Note that the duration value is from 0 to 1, where a value of 0.5 would have a "half and half" interpolation from one set to the other.
zh_cn: 注意，持续时间值是从0到1，其中值0.5表示从一个集合到另一个集合的"一半一半"插值。

source: Note that the final GIF data will have been palletized using the Universal 884 Palette (see here for more information).
zh_cn: 注意，最终的GIF数据将使用通用884调色板(参见这里了解更多信息)进行托盘化。

source: Note that the fog start indicates the radius relative to the view camera where the fog starts, and the fog end indicates at which radius (also relative) instances will be completely invisible.
zh_cn: 注意，雾开始指示相对于视图相机的雾开始的半径，雾结束指示在哪个半径(也是相对的)实例将完全不可见。

source: Note that the friction is usually set to a value between 0 and 1, but you can use any non-negative value if required.
zh_cn: 注意，摩擦通常设置为0到1之间的值，但如果需要，也可以使用任何非负值。

source: Note that the function also accepts the special keyword all, in which case all instances found to be in collision will be listed.
zh_cn: 注意，此函数还接受特殊关键字all，在这种情况下，将列出所有发现有碰撞的实例。

source: Note that the function can only be used to check local files, but not any files stored on a remote server.
zh_cn: 注意，此函数只能用于检查本地文件，而不能检查存储在远程服务器上的任何文件。

source: Note that the function cannot require any additional arguments when using this function, and if you use it to modify a Timeline asset present in the Asset Browser, then all instances that use this timeline will be affected, and the change will last until the end of the game (calling game_restart() will not reset the change either).
zh_cn: 注意，在使用此函数时，此函数不能要求任何附加参数，并且如果您使用它来修改资源浏览器中存在的时间轴资源，则使用该时间轴的所有实例都将受到影响，并且更改将持续到游戏结束(调用game_restart()也不会重置更改)。

source: Note that the function is not meant to be called in any draw events or step events, but rather only needs to be called at the start of the room in the Room Creation Code or in the Create Event / Room Start Event of an instance.
zh_cn: 注意，此函数并不意味着在任何draw事件或step事件中调用，而是只需要在房间创建代码中的房间开始处或在实例的Create事件/ Room Start事件中调用。

source: Note that the function will load from a "default" folder, which does not need to be included as part of the file path you provide.
zh_cn: 注意，此函数将从"默认"文件夹加载，该文件夹不需要包含在您提供的文件路径中。

source: Note that the function will modify the array supplied directly, but will also return a reference to it (or a reference to a new array if none is supplied).
zh_cn: 注意，此函数将修改直接提供的数组，但也会返回对它的引用(如果没有提供数组，则返回对新数组的引用)。

source: Note that the function will return -1 if flush is not supported for the chosen resource, or it will return 0 if all worked correctly.
zh_cn: 注意，如果所选资源不支持刷新，此函数将返回-1；如果一切正常，此函数将返回0。

source: Note that the function will return -1 if flush is not supported for the chosen resources, or it will return 0 if all worked correctly.
zh_cn: 注意，如果所选资源不支持刷新，此函数将返回-1；如果一切正常，此函数将返回0。

source: Note that the function will return -1 if prefetch is not supported for the chosen resource or the target platform is HTML5, or it will return 0 if all worked correctly.
zh_cn: 注意，如果所选资源不支持预取，或者目标平台是HTML5，则此函数将返回-1；如果一切正常，则此函数将返回0。

source: Note that the gain scale is linear, and to instantly change the gain, simply set the time argument to 0.
zh_cn: 注意，增益比例是线性的，要立即改变增益，只需将时间参数设置为0。

source: Note that the instance must have a speed for wrapping to work, because the direction of wrapping is based on the direction of the motion.
zh_cn: 注意，实例必须有一个速度才能进行环绕，因为环绕的方向取决于运动的方向。

source: Note that the list is always sorted in descending order starting from the top-most slot.
zh_cn: 注意，该列表总是从最顶端的槽开始按降序排序。

source: Note that the maximum number of device touches that can be detected will depend very much on the device being used and the OS it runs
zh_cn: 注意，能够检测到的设备触摸的最大次数在很大程度上取决于所使用的设备及其运行的操作系统

source: Note that the maximum number of touches that can be detected will depend very much on the device being used and the OS it runs
zh_cn: 需要注意的是，能够检测到的触摸的最大数量取决于所使用的设备及其运行的操作系统

source: Note that the message can be either a string or a real number, but if you need both then the number will have to be converted to string first using the string() function (see the example below) and that if the number has more than two decimal places then you should use string_format() to show them as by default decimals are rounded to the nearest two decimal places (so "1.2468" would show as "1.25" in the output window).
zh_cn: 注意，消息可以是字符串或实数，但是如果您需要两者，则必须首先使用string()函数将数字转换为字符串(请参见下面的示例)，如果数字有两个以上的小数位，则您应该使用string_format()来显示它们，因为默认情况下，小数四舍五入到最接近的两个小数位(因此"1.2468"将在输出窗口中显示为"1.25")。

source: Note that the minimum number of particles you can create in a simulation is 128, so setting this value any lower will have no effect (unless set to 0).
zh_cn: 注意，在模拟中可以创建的最小粒子数是128，因此将该值设置得更低将不会有任何效果(除非设置为0)。

source: Note that the position is in frames and if you set a value greater than the total number of frames (or less than 0) then the actual final playhead position will depend on the type of sequence playback that has been selected, following these rules:
zh_cn: 注意位置以帧为单位，如果你设置的值大于总帧数(或小于0)，那么实际的最终播放头位置将取决于已选择的序列播放类型，遵循以下规则:

source: Note that the return value will be very different depending on the type of speed that was applied in the Sprite Editor, either Frames Per Second, or Frames Per Game Frame.
zh_cn: 注意，根据精灵编辑器中应用的速度类型(每秒帧数或每游戏帧帧数)，返回值会有很大不同。

source: Note that the room will not change until the end of the event where the function was called, so any code after this has been called will still run if in the same event.
zh_cn: 注意，在调用函数的事件结束之前，房间是不会改变的，因此在调用此函数之后的任何代码都将在相同的事件中运行。

source: Note that the room will not change until the end of the event where the function was called, so any code after this has been called will still run if in the same event. This function will also trigger the Room End event.
zh_cn: 注意，在调用函数的事件结束之前，房间是不会改变的，因此在调用此函数之后的任何代码都将在相同的事件中运行。此函数还将触发Room End事件。

source: Note that the room will not restart until the end of the event where the function was called, so any code after this has been called will still run if in the same event.
zh_cn: 注意，直到调用此函数的事件结束，房间才会重新启动，因此，如果在同一个事件中，调用此函数之后的任何代码都将继续运行。

source: Note that the sprite should have been designed in your animation program with this in mind, such that the "base" animation in track 0 only has keyframes for certain bones, while the next tracks have keyframes for the others.
zh_cn: 注意，在动画程序中设计精灵时应该考虑到这一点，这样，轨迹0中的"基础"动画仅包含特定骨骼的关键帧，而接下来的轨迹包含其他骨骼的关键帧。

source: Note that the string returned is not the same as the resource ID and cannot be used to access the resource itself, so should only be used for displaying or error checking.
zh_cn: 注意，返回的字符串与资源ID不相同，不能用于访问资源本身，因此应该只用于显示或错误检查。

source: Note that the timeout does not generate any type of event, so you will need to deal with timeouts yourself using alarms (for example).
zh_cn: 注意，超时不会生成任何类型的事件，因此您需要使用告警(例如)自己处理超时。

source: Note that the value can be an array, which you can check with the function is_array().
zh_cn: 注意，该值可以是一个数组，可以用函数is_array()来检查。

source: Note that there are a few things you cannot do with the buffer when accessing from an extension:
zh_cn: 注意，从扩展访问时，有几件事你不能用缓冲区做:

source: Note that there is no time limit on this function, so you will need to use a variable or an alarm to switch off the vibration (set motors to 0) after a given time has passed otherwise the gamepad will continue to vibrate indefinitely.
zh_cn: 注意此函数没有时间限制，所以你需要在特定时间过后使用一个变量或警报来关闭震动(将马达设置为0)，否则游戏手柄将继续无限地震动。

source: Note that there isn't much difference between the default quality of 2, and the highest of 3, and using 3 will significantly slow down the creation of the GIF so care should be taken when using the maximum value.
zh_cn: 注意，默认质量2和最高质量3之间没有太大区别，使用3会显著降低GIF的创建速度，因此在使用最大值时应该小心。

source: Note that there may be a slight delay between the user connecting the gamepad and GameMaker detecting it as being connected (this is especially the case when dealing with bluetooth connected controllers).
zh_cn: 注意，在用户连接游戏手柄和GameMaker检测到它已连接之间可能会有一点延迟(尤其是在处理蓝牙连接控制器时)。

source: Note that this can be quite useful for avoiding bleeding artifacts when rendering textures, for example, setting the texture page border to 8px and then setting the max mipmap level to 3 will ensure you don't get any bleeding problems at greater render distances.
zh_cn: 注意，这对于在渲染纹理时避免出血现象非常有用，例如，将纹理页面边框设置为8px，然后将最大小中见大贴图级别设置为3，将确保在更大的渲染距离时不会出现出血问题。

source: Note that this can only be done on sequence instances (not sequence objects) and must be done before the sequence starts to play, otherwise it won't work.
zh_cn: 注意，这只能在序列实例(而不是序列对象)上执行，并且必须在序列开始播放之前执行，否则将无法工作。

source: Note that this can return negative values too, in which case rendered textures will be sharper over a greater distance the lower the value.
zh_cn: 注意，这也可能返回负值，在这种情况下，值越低，渲染的纹理在更大的距离上会更清晰。

source: Note that this can return negative values too, in which case shader textures will be sharper over a greater distance the lower the value.
zh_cn: 注意，这也可能会返回负值，在这种情况下，值越低，着色器纹理在更大的距离上会更清晰。

source: Note that this checks to see if an object is present in the Asset Browser, and not actually in the game room.
zh_cn: 注意，这将检查对象是否出现在资源浏览器中，而不是实际出现在游戏房间中。

source: Note that this data refers to the current pose for the skeleton, depending on the animation set used, and the function requires a previously created DS map, which will then have the following keys and their equivalent values after calling the function:
zh_cn: 注意，该数据指的是骨骼的当前姿势，具体取决于所使用的动画集，并且此函数需要先前创建的DS贴图，在调用此函数后，该贴图将具有以下关键点及其等效的值:

source: Note that this data refers to the default pose for the skeleton, and not the current pose that is being drawn (for that use the function skeleton_bone_state_set()), and must be set from a previously created DS map, which should have the following keys and their equivalent values:
zh_cn: 注意，该数据指的是骨骼的默认姿势，而不是正在绘制的当前姿势(使用skeleton_bone_state_set()函数)，并且必须从以前创建的DS贴图中设置，该贴图应具有以下关键点及其等效值:

source: Note that this data refers to the default pose for the skeleton, and not the current pose that is being drawn.
zh_cn: 注意，该数据指的是骨骼的默认姿势，而不是正在绘制的当前姿势。

source: Note that this data will set the current pose for the skeleton, depending on the animation set used, and the function requires a previously created DS map, which should have the following keys and their required values:
zh_cn: 注意，该数据将设置骨骼的当前姿势，具体取决于所使用的动画集，并且此函数需要先前创建的DS贴图，该贴图应具有以下关键点及其所需的值:

source: Note that this does NOT change the camera ID value, only the settings for that camera, and that if you use this function on the default camera (ie: the internal camera GameMaker uses when no view cameras are active) the changes will be overwritten the very next game frame by the internal settings for drawing the room.
zh_cn: 注意，这不会改变相机ID值，只会改变该相机的设置，并且如果您在默认相机上使用此函数(即，GameMaker在没有视图相机活动时使用的内部相机)，这些更改将在下一个游戏帧被绘制房间的内部设置覆盖。

source: Note that this does NOT remove the contents from the original priority queue, nor does it destroy the original priority queue.
zh_cn: 注意，这不会从原始优先队列中删除内容，也不会破坏原始优先队列。

source: Note that this does NOT remove the contents from the original queue, nor does it destroy the original queue.
zh_cn: 注意，这不会从原始队列中删除内容，也不会销毁原始队列。

source: Note that this does NOT remove the contents from the original stack, nor does it destroy the original stack.
zh_cn: 注意，这不会从原始堆栈中删除内容，也不会破坏原始堆栈。
